docs/posts/2008-10-22-consumer-pornography.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Consumer Pornography</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Consumer Pornography</h1>
<p class="subtitle" role="doc-subtitle">Oct 22, 2008</p>
</header><p>
Prophetic thought for the day from Mark Woods, editor of Britain&rsquo;s <i>Baptist Times</i>, in a column for <a href="http://www.ethicsdaily.com/article_detail.cfm?AID=11221">Ethics Daily.com</a>:
</p>

<blockquote>
<p>
The glossy lifestyle magazines which are such a feature of weekend papers are consumer pornography, designed to titillate us with longings for what most of us can never have, and those of us who can will never need.
</p>
</blockquote>


<div class="tagline" id="orge9751b0">
<p>
Tagged: <a href="../tags/quotes.html">Quotes</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
